export const BENEFITS: string[] = [
  "AI-квізи",
  "Q&A сесії",
  "Розв'язки завдань",
  "Тех-чеки",
  "Уроки англійської",
  "Кар'єрний модуль"
];

export const STEPS: {title: string, description: string}[] = [
  {title: "Навчимо необхідному", description: "Отримай знання та навички для першої роботи в ІТ."},
  {title: "Зберемо портфоліо", description: "Створи реальні проєкти разом із ментором."},
  {title: "Підготуємо до співбесід", description: "Навчись проходити співбесіди і писати резюме."},
  {title: "Подамось на вакансії", description: "Пройди всі етапи найму з нашою підтримкою."},
  {title: "Допоможемо знайти роботу", description: "Досягни мети та стань"},
];

export const COURSES: {name: string, url: string}[] = [
  {name: "UI/UX designer", url: "ui-ux"},
  {name: "Data analyst", url: "data-analyst"},
  {name: "QA engineer", url: "qa"},
  {name: "Python developer", url: "python"},
  {name: "Front-end developer", url: "frontend"},
  {name: "Digital marketer", url: "digital-marketer"},
  {name: "Full-stack developer", url: "fullstack"},
  {name: "DevOps engineer", url: "devops"},
  {name: "Recruiter", url: "recruiter"},
  {name: "Java developer", url: "java"},
];

export const FAQS: {question: string, answer: string}[] = [
  {question: "Як почати навчатись в Course academy?", answer: "Після реєстрації на платформі ти можеш додати курс, який містить теоретичні та практичні завдання. Після цього система автоматично сформує для тебе графік навчання: перше завдання потрібно виконати до кінця наступного дня після додавання курсу, потім буде день відпочинку, а наступне завдання потрібно виконати до кінця наступного дня після відпочинку. Ти можеш проходити матеріали у зручному темпі, але важливо дотримуватись встановленого графіка, щоб ефективно засвоювати знання."},
  {question: "Чи потрібні мені знання математики або технічна освіта?", answer: "Ні, навчання розраховане на новачків. Тобі не потрібно знати математику чи мати технічний бекграунд, оскільки всі необхідні навички ти отримаєш у процесі проходження курсу. Головне – це бажання вчитися, логічне мислення та готовність регулярно виконувати завдання."},
  {question: "Чи є вікові обмеження для цього курсу?", answer: "Навчатися може будь-хто, але курс для неповнолітніх є за згодою батьків. Гарантія працевлаштування працює, якщо до моменту завершення курсу ти досягнеш віку, необхідного для офіційного працевлаштування у своїй країні."},
  {question: "Як організоване навчання та завдання?", answer: "Кожен курс складається з теоретичних матеріалів і практичних завдань, які проходять у чітко визначеному ритмі. Перше завдання після додавання курсу потрібно виконати до кінця наступного дня, потім йде день відпочинку, а наступне завдання потрібно зробити до кінця наступного дня після відпочинку. Така система допомагає краще засвоювати матеріал і не перевантажуватись."},
  {question: "Чи отримаю я сертифікат після курсу?", answer: "Так, після успішного проходження курсу ти отримаєш сертифікат, який можна додати до резюме, LinkedIn або використати для демонстрації своїх навичок потенційним роботодавцям."},
  {question: "Як працює гарантія працевлаштування?", answer: "Ми надаємо підтримку у пошуку роботи для всіх випускників, які виконували завдання згідно з графіком, брали участь у кар’єрних заходах та проходили співбесіди. Ми допомагаємо скласти резюме, оформити профілі в соцмережах, підготуватися до інтерв’ю та знайти першу роботу в IT."},
  {question: "Чому ви впевнені, що я знайду роботу?", answer: "Навчальна програма складається на основі актуальних вимог ринку і постійно оновлюється. Під час навчання ти отримаєш практичний досвід, працюватимеш з реальними завданнями та отримаєш персоналізовану підтримку у процесі пошуку роботи. Завдяки цьому більшість наших випускників знаходять роботу протягом кількох місяців після закінчення курсу."}
];
